cask_args appdir: "~/Applications"

# Taps
tap "ankitpokhrel/jira-cli"
tap "aws/tap"
tap "c-bata/kube-prompt"
tap "carvel-dev/carvel"
tap "common-fate/granted"
tap "danielfoehrkn/switch"
tap "derailed/k9s"
tap "espanso/espanso"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "johanhaleby/kubetail"
tap "kreuzwerker/taps"
tap "localsend/localsend"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "pamburus/tap"
tap "pkgxdev/made"
tap "warrensbox/tap"

# CLI Tools
brew "argocd"
brew "atuin"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bat"
brew "python@3.12"
brew "glib"
brew "node"
brew "corepack", link: false
brew "difftastic"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "fn"
brew "fzf"
brew "gh"
brew "git"
brew "glow"
brew "gnu-sed"
brew "go"
brew "go-task"
brew "grpcurl"
brew "harfbuzz"
brew "helix"
brew "helm"
brew "hstr"
brew "htop"
brew "jq"
brew "just"
brew "openjdk"
brew "kafka"
brew "kcat"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kubecolor"
brew "kubectx"
brew "kubie"
brew "kustomize"
brew "lazygit"
brew "lnav"
brew "lolcat"
brew "lsd"
brew "minikube"
brew "navi"
brew "neofetch"
brew "neovim"
brew "ninvaders"
brew "ollama"
brew "pfetch"
brew "pipx"
brew "portal"
brew "ripgrep"
brew "ripsecrets"
brew "sd"
brew "starship"
brew "stern"
brew "stow"
brew "telnet"
brew "termshark"
brew "terraform"
brew "terragrunt"
brew "tmux"
brew "tree"
brew "up"
brew "wget"
brew "xh"
brew "yazi"
brew "yq"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "aws/tap/copilot-cli"
brew "aws/tap/eks-node-viewer"
brew "c-bata/kube-prompt/kube-prompt"
brew "carvel-dev/carvel/ytt"
brew "danielfoehrkn/switch/switch"
brew "derailed/k9s/k9s"
brew "johanhaleby/kubetail/kubetail"
brew "kreuzwerker/taps/m1-terraform-provider-helper"
brew "oven-sh/bun/bun"
brew "pamburus/tap/hl"
brew "pkgxdev/made/pkgx"
brew "warrensbox/tap/tgswitch"

# GUI Tools
cask "aerospace"
cask "alacritty"
cask "alt-tab"
cask "coteditor"
cask "dbeaver-community"
cask "doll"
cask "espanso"
cask "fsnotes"
cask "hammerspoon"
cask "keka"
cask "lens"
cask "localsend"
cask "logseq"
cask "macdown"
cask "mark-text"
cask "notable"
cask "obsidian"
cask "openlens"
cask "orbstack"
cask "raycast"
cask "remote-desktop-manager"
cask "rio"
cask "vlc"
cask "vscodium"
cask "wezterm"
cask "wireshark"

# VS Code Extensions
vscode "4ops.terraform"
vscode "atlassian.atlascode"
vscode "bbenoist.nix"
vscode "betajob.modulestf"
vscode "christian-kohler.path-intellisense"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "jnoortheen.nix-ide"
vscode "jonasschwabe.jnyamlpath"
vscode "kdl-org.kdl"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "lunuan.kubernetes-templates"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.remote-explorer"
vscode "pomdtr.excalidraw-editor"
vscode "qcz.text-power-tools"
vscode "redhat.vscode-yaml"
vscode "rushfrisby.encryptor"
vscode "smoore.yaml-path"
vscode "supermaven.supermaven"
vscode "tamasfe.even-better-toml"
vscode "technosophos.vscode-helm"
vscode "tim-koehler.helm-intellisense"
vscode "waderyan.gitblame"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
