tap "airbytehq/tap"
tap "ankitpokhrel/jira-cli"
tap "aws/tap"
tap "birdayz/kaf"
tap "browsh-org/browsh"
tap "c-bata/kube-prompt"
tap "carvel-dev/carvel"
tap "common-fate/granted"
tap "daniele-rolli/beaver"
tap "danielfoehrkn/switch"
tap "derailed/k9s"
tap "derailed/popeye"
tap "espanso/espanso"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "johanhaleby/kubetail"
tap "koekeishiya/formulae"
tap "kreuzwerker/taps"
tap "localsend/localsend"
tap "nikitabobko/tap"
tap "noahgorstein/tap"
tap "oven-sh/bun"
tap "pamburus/tap"
tap "pkgxdev/made"
tap "vladimirvivien/oss-tools"
tap "warrensbox/tap"
tap "xo/xo"
brew "argocd"
brew "asdf"
brew "atuin"
brew "python@3.12"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bat"
brew "btop"
brew "glib"
brew "carapace"
brew "clipboard"
brew "cmctl"
brew "dasel"
brew "difftastic"
brew "dust"
brew "emacs"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "fn"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "gnu-sed"
brew "go"
brew "grpcurl"
brew "gum"
brew "harfbuzz"
brew "helix"
brew "helm"
brew "hey"
brew "hstr"
brew "htop"
brew "hyperfine"
brew "jnv"
brew "jq"
brew "just"
brew "openjdk"
brew "kafka"
brew "kcat"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kubecolor"
brew "kubectx"
brew "kubie"
brew "kustomize"
brew "lazygit"
brew "libpq"
brew "lima"
brew "lnav"
brew "lolcat"
brew "lsd"
brew "lynx"
brew "m-cli"
brew "mas"
brew "mcfly"
brew "micro"
brew "minikube"
brew "mysql-client"
brew "nap"
brew "neofetch"
brew "neovim"
brew "ninvaders"
brew "node"
brew "nsnake"
brew "nushell"
brew "oha"
brew "ollama"
brew "parquet-cli"
brew "pfetch"
brew "pipx"
brew "podman"
brew "portal"
brew "ripgrep"
brew "ripsecrets"
brew "rust"
brew "sd"
brew "simg2img"
brew "starship"
brew "stern"
brew "stow"
brew "superfile"
brew "task"
brew "taskwarrior-tui"
brew "telnet"
brew "wireshark", link: false
brew "termshark"
brew "terraform"
brew "terragrunt"
brew "tmux"
brew "todo-txt"
brew "tree"
brew "up"
brew "watch"
brew "websocat"
brew "wget"
brew "xh"
brew "yazi"
brew "yq"
brew "zellij"
brew "zenith"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "airbytehq/tap/abctl"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "aws/tap/copilot-cli"
brew "aws/tap/eks-node-viewer"
brew "browsh-org/browsh/browsh"
brew "c-bata/kube-prompt/kube-prompt"
brew "carvel-dev/carvel/ytt"
brew "danielfoehrkn/switch/switch"
brew "derailed/k9s/k9s"
brew "derailed/popeye/popeye"
brew "felixkratz/formulae/borders"
brew "johanhaleby/kubetail/kubetail"
brew "koekeishiya/formulae/skhd"
brew "kreuzwerker/taps/m1-terraform-provider-helper"
brew "noahgorstein/tap/jqp"
brew "oven-sh/bun/bun"
brew "pamburus/tap/hl"
brew "pkgxdev/made/pkgx"
brew "vladimirvivien/oss-tools/ktop"
brew "warrensbox/tap/tgswitch"
brew "xo/xo/usql", args: ["with-odbc"]
cask "aerospace"
cask "alacritty"
cask "alt-tab"
cask "beaver-notes"
cask "coteditor"
cask "dbeaver-community"
cask "doll"
cask "espanso"
cask "firefox"
cask "firefox@nightly"
cask "floorp"
cask "fsnotes"
cask "hammerspoon"
cask "heynote"
cask "hiddenbar"
cask "keka"
cask "leader-key"
cask "lens"
cask "localsend"
cask "logseq"
cask "macdown"
cask "mark-text"
cask "monokle"
cask "notable"
cask "notion"
cask "obsidian"
cask "openlens"
cask "orbstack"
cask "postman"
cask "qutebrowser"
cask "raycast"
cask "rectangle"
cask "remote-desktop-manager"
cask "rio"
cask "vlc"
cask "vscodium"
cask "weektodo"
cask "wezterm"
cask "whatsapp"
cask "wireshark"
cask "zen-browser"
vscode "4ops.terraform"
vscode "atlassian.atlascode"
vscode "bbenoist.nix"
vscode "betajob.modulestf"
vscode "brenosolutions.sqlformatter"
vscode "christian-kohler.path-intellisense"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "jnoortheen.nix-ide"
vscode "jonasschwabe.jnyamlpath"
vscode "kdl-org.kdl"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "lunuan.kubernetes-templates"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mohamed-nouri.websocket-client"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-markdown-notebook"
vscode "pomdtr.excalidraw-editor"
vscode "qcz.text-power-tools"
vscode "redhat.vscode-yaml"
vscode "saibabuboddeda.json-path-finder"
vscode "smoore.yaml-path"
vscode "supermaven.supermaven"
vscode "tamasfe.even-better-toml"
vscode "tim-koehler.helm-intellisense"
vscode "waderyan.gitblame"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
