tap "airbytehq/tap"
tap "ankitpokhrel/jira-cli"
tap "aws/tap"
tap "birdayz/kaf"
tap "browsh-org/browsh"
tap "c-bata/kube-prompt"
tap "carvel-dev/carvel"
tap "common-fate/granted"
tap "daniele-rolli/beaver"
tap "danielfoehrkn/switch"
tap "derailed/k9s"
tap "derailed/popeye"
tap "espanso/espanso"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "johanhaleby/kubetail"
tap "koekeishiya/formulae"
tap "kreuzwerker/taps"
tap "localsend/localsend"
tap "nikitabobko/tap"
tap "noahgorstein/tap"
tap "oven-sh/bun"
tap "pamburus/tap"
tap "pkgxdev/made"
tap "vladimirvivien/oss-tools"
tap "warrensbox/tap"
tap "xo/xo"
brew "argocd"
brew "atuin"
brew "python@3.12"
brew "awscli"
brew "bash"
brew "btop"
brew "difftastic"
brew "dust"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "grpcurl"
brew "gum"
brew "harfbuzz"
brew "helm"
brew "hey"
brew "htop"
brew "hyperfine"
brew "jnv"
brew "jq"
brew "just"
brew "kcat"
brew "kubernetes-cli"
brew "krew"
brew "kubecolor"
brew "kubectx"
brew "kubie"
brew "kustomize"
brew "lazygit"
brew "libpq"
brew "neovim"
brew "node"
brew "ollama"
brew "parquet-cli"
brew "pipx"
brew "ripgrep"
brew "ripsecrets"
brew "rust"
brew "sd"
brew "starship"
brew "stern"
brew "stow"
brew "task"
brew "telnet"
brew "terraform"
brew "terragrunt"
brew "tmux"
brew "tree"
brew "up"
brew "watch"
brew "websocat"
brew "wget"
brew "yazi"
brew "yq"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "aws/tap/eks-node-viewer"
brew "derailed/k9s/k9s"
brew "derailed/popeye/popeye"
brew "johanhaleby/kubetail/kubetail"
brew "koekeishiya/formulae/skhd"
brew "noahgorstein/tap/jqp"
brew "pkgxdev/made/pkgx"
brew "vladimirvivien/oss-tools/ktop"
brew "warrensbox/tap/tgswitch"
brew "xo/xo/usql", args: ["with-odbc"]
cask "aerospace"
cask "alt-tab"
cask "doll"
cask "espanso"
cask "heynote"
cask "hiddenbar"
cask "keka"
cask "leader-key"
cask "localsend"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "raycast"
cask "vlc"
cask "wezterm"
cask "whatsapp"
cask "wireshark"
cask "zen-browser"
vscode "4ops.terraform"
vscode "atlassian.atlascode"
vscode "bbenoist.nix"
vscode "betajob.modulestf"
vscode "brenosolutions.sqlformatter"
vscode "christian-kohler.path-intellisense"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "jnoortheen.nix-ide"
vscode "jonasschwabe.jnyamlpath"
vscode "kdl-org.kdl"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "lunuan.kubernetes-templates"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mohamed-nouri.websocket-client"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-markdown-notebook"
vscode "pomdtr.excalidraw-editor"
vscode "qcz.text-power-tools"
vscode "redhat.vscode-yaml"
vscode "saibabuboddeda.json-path-finder"
vscode "smoore.yaml-path"
vscode "supermaven.supermaven"
vscode "tamasfe.even-better-toml"
vscode "tim-koehler.helm-intellisense"
vscode "waderyan.gitblame"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
